# OriginatingElementDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..OriginatingElementDescription Property
EnergyAnalysisSurface Class See Also
---
The description for the originating Revit element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string OriginatingElementDescription { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OriginatingElementDescription As String
	Get
```

Visual C++
---
```text
public:
property String^ OriginatingElementDescription {
	String^ get ();
}
```

# Remarks
Surface and Opening elements get an originating element assigned according to the below described schema, based on associative room bounding element:
(Family Name): (Family Type)[Element Id]
Sample: Basic Wall: Cast Concrete Wall 12" [49749]
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace